LtyIntegrationTest/LtyTransaction/target/test-classes/data/json/Request_cusLookupByName.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ent="http://www.macys.com/enterprise_services" xmlns:v11="http://loyalty.macys.com/schemas/loyalty.customer/CusRequest/v11_0" xmlns:v111="http://loyalty.macys.com/schemas/loyalty.customer/CusCommon/v11_0" xmlns:v112="http://loyalty.macys.com/schemas/loyalty.customer/MacysCommon/v11_0">
   <soapenv:Header>
      <ent:requestor_info>
         <!--Optional:-->
         <version>?</version>
         <client_id>Stores</client_id>
         <subclient_id>SPOS</subclient_id>
      </ent:requestor_info>
   </soapenv:Header>
   <soapenv:Body>
      <v11:CusLookupByNameReq>
         <v111:NameFirst>MCY</v111:NameFirst>
         <v111:NameLast>ACCOUNT</v111:NameLast>
         <!--Optional:-->     
         <v111:PostalCd>94132</v111:PostalCd><v112:Division>71</v112:Division>
         <v112:Channel>SPOS</v112:Channel>
         <v112:AssociateId>12345</v112:AssociateId>
         <v11:RequestCount>1</v11:RequestCount>
      </v11:CusLookupByNameReq>
   </soapenv:Body>
</soapenv:Envelope>